app/controllers/locations_controller.rb

    def index
        @location = Location.all
---
SELECT "locations".* FROM "locations"

    def edit
        @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @location = Location.new(locations_params)

        if @location.save
---
INSERT INTO "locations" ("titre", "nbChambre", "nbCouchage", "description", "ville", "rue", "numRue", "lat", "long", "prix", "photos", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @location = Location.find(params[:id])
        if @location.update(locations_params)
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "locations" SET "description" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["description", "azerazerazerazerazeraz"], ["updated_at", "2022-02-03 22:34:28.539460"], ["id", 11]]

    def destroy
        @location = Location.find(params[:id])
        @location.destroy
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 10]]