app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "test@gmail.com"], ["password", "azerty"], ["created_at", "2022-02-03 18:04:18.501493"], ["updated_at", "2022-02-03 18:04:18.501493"]]