app/models/location.rb

def self.search_by_rate(search)
    if search
        search_rate = search.to_i
        if self.where({prix: 0..search_rate})
            self.where({prix: 0..search_rate})
---
SELECT "locations".* FROM "locations" WHERE "locations"."rate" BETWEEN ? AND ?  [["rate", 0], ["rate", 500]]